// Denverton AptioV override start - EIP#278398
//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 2006 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   Strings.uni
// 
// Abstract:
// 
//   String definitions for Sample Setup formset.
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "en-USlish"
#langdef   fr-FR "fr-FRnçais"
#langdef   es-ES "Español"
                     
#string STR_ENABLE                       #language en-US  "Enable"



#string STR_DISABLE                      #language en-US  "Disable"
#string STR_AUTO                         #language en-US  "Auto"
#string STR_HIDE                         #language en-US  "Hide"

#string STR_ERROR_POPUP                  #language en-US  "Try Again"

#string STR_ERROR_POPUP                  #language en-US  "Try Again"

#string STR_BUILD_TIME_VALUE             #language en-US  ""

#string STR_BUILD_TIME_STRING 	         #language en-US "Build Time"

#string STR_NULL_STRING  	               #language en-US  ""


// TPM 

#string STR_TPM_TITLE              #language en-US  "TPM"

#string STR_TPM_HELP               #language en-US  "Press <Enter> to select the TPM Setup options."

#string STR_TPM_ADMIN_PROMPT       #language en-US "TPM Adminstrative Control"

#string STR_TPM_ADMIN_HELP         #language en-US "Enable TPM Adminstrative Control for making changes to TPM Device and TPM state."

#string STR_TPM_DEVICE_PROMPT      #language en-US "TPM Device"

#string STR_TPM_DEVICE_HELP        #language en-US "Enable/Disable the TPM device, setting takes effect on the next boot."

#string STR_TPM_STATE_PROMPT       #language en-US "TPM State"

#string STR_TPM_STATE_HELP         #language en-US "Activate/Deactivate the TPM device, setting takes effect on the next boot."

#string STR_ACTIVATE               #language en-US "Activate"

#string STR_DEACTIVATE             #language en-US "Deactivate"

#string STR_TPM_FORCE_CLEAR_PROMPT #language en-US "TPM Force Clear"

#string STR_TPM_FORCE_CLEAR_HELP   #language en-US "Force Clear TPM data."

#string VAR_EQ_ADMIN_NAME               #language en-US  "65"


// Passwords

#string STR_SECURITY_TITLE                #language en-US  "Security"

#string STR_SECURITY_HELP                 #language en-US  "Press <Enter> to select the Security Setup options."

#string STR_USER_PASSWORD_PROMPT          #language en-US  "User Password"

#string STR_USER_PASSWORD_HELP            #language en-US  "Sets personal password"

#string STR_ADMIN_PASSWORD_PROMPT         #language en-US  "Admin Password"

#string STR_ADMIN_PASSWORD_HELP           #language en-US  "Sets administrative password"

#string STR_SECURITY_PASSWORD_INVALID     #language en-US  "Incorrect password"

#string STR_SECURITY_PASSWORD_VALID       #language en-US  "Setup is now unlocked"

#string STR_SECURITY_PASSWORD_LEN_USTH      #language en-US  "The password needs to be at least 6 characters long."

#string STR_CLEAR_PASSWORD_TEXT           #language en-US  "Clear password"

#string STR_CLEAR_PASSWORD_HELP           #language en-US  "This allows user to clear passwords."

#string STR_ENTER_PASSWORD_TEXT           #language en-US  "Unlock Setup"

#string STR_ENTER_PASSWORD_HELP           #language en-US  "This allows user to enter passwords."


#string STR_USER_PASSWORD_STATUS           #language en-US  "Current Status of User Password"

#string STR_ADMIN_PASSWORD_STATUS          #language en-US  "Current Status of Admin Password"

#string STR_ADMIN_PASSWORD_STATUS_DYNAMICTEXT #language en-US "TEXT NOT SET!"

#string STR_USER_PASSWORD_STATUS_DYNAMICTEXT  #language en-US "TEXT NOT SET!"


#string VAR_EQ_ADMIN_PASS_SET             #language en-US  "AdminPassSet"


#string STR_ACCESS_LEVEL                  #language en-US "Access Level"

#string STR_ACCESS_USER                   #language en-US "User"

#string STR_ACCESS_ADMIN                  #language en-US "Administrator"

#string STR_USER_HELP                     #language en-US "Entered in User mode - Restricted Access"

#string STR_ADMIN_HELP                    #language en-US "Entered in Administrator mode "


#string STR_RELAX_SEC_CONF		  #language en-US "Relax Security Configuration"

#string STR_RELAX_SEC_CONF_HELP		  #language en-US "Relaxes the security configuration to be able to use BIOS update tools"


// strings for PCI form
#string STR_PCI_FORM                    #language en-US  "PCI Subsystem Settings"

#string STR_PCI_HP_FORM                 #language en-US   "PCI Hot-Plug Settings"


#string STR_PCI_FORM_HELP               #language en-US "PCI, PCI-X and PCI Express Settings."

#string STR_PCI_LATENCY_PROMPT          #language en-US "PCI Latency Timer"

#string STR_PCIX_LATENCY_PROMPT         #language en-US "PCI-X Latency Timer"

#string STR_PCI_LATENCY_HELP            #language en-US "Value to be programmed into PCI Latency Timer Register."



#string STR_PCI_SETTINGS                #language en-US "PCI Common Settings"

#string STR_PCIX                        #language en-US "PCI-X Device Settings"

#string STR_PCIE_DEVICE                 #language en-US "PCI Express Device Settings"

#string STR_PCIE_LINK                   #language en-US "PCI Express Link Settings"



#string STR_PCI_VGASNOOP_PROMPT         #language en-US "VGA Palette Snoop"

#string STR_PCI_VGASNOOP_HELP           #language en-US "Enables or Disables VGA Palette Registers Snooping."

#string STR_PCI_PERR_PROMPT             #language en-US "PERR# Generation"

#string STR_PCI_PERR_HELP               #language en-US "Enables or Disables PCI Device to Generate PERR#."

#string STR_PCI_SERR_PROMPT             #language en-US "SERR# Generation"

#string STR_PCI_SERR_HELP               #language en-US "Enables or Disables PCI Device to Generate SERR#."

#string STR_PCI_4G_PROMPT               #language en-US "Above 4G Decoding"

#string STR_PCI_4G_HELP                 #language en-US "Enables or Disables 64bit capable Devices to be Decoded in Above 4G Address Space (Only if System Supports 64 bit PCI Decoding)."



#string STR_PCI_32                      #language en-US "32 PCI Bus Clocks"

#string STR_PCI_64                      #language en-US "64 PCI Bus Clocks"

#string STR_PCI_96                      #language en-US "96 PCI Bus Clocks"

#string STR_PCI_128                     #language en-US "128 PCI Bus Clocks"

#string STR_PCI_160                     #language en-US "160 PCI Bus Clocks"

#string STR_PCI_192                     #language en-US "192 PCI Bus Clocks"

#string STR_PCI_224                     #language en-US "224 PCI Bus Clocks"

#string STR_PCI_248                     #language en-US "248 PCI Bus Clocks"



#string STR_PCI_OPTION_ROM_POST         #language en-US "PCI ROM Priority"

#string STR_PCI_OPTION_ROM_POST_HELP    #language en-US "In case of multiple Option ROMs (Legacy and EFI Compatible), specifies what PCI Option ROM to launch."



#string STR_PCI_LEGACY                  #language en-US "Legacy ROM"

#string STR_PCI_EFI                     #language en-US "EFI Compatible ROM"



#string STR_PCIE_RELAXEDORDERING_PROMPT #language en-US "Relaxed Ordering"

#string STR_PCIE_RELAXEDORDERING_HELP   #language en-US "Enables or Disables PCI Express Device Relaxed Ordering."



#string STR_PCIE_NOSNOOP_PROMPT         #language en-US "No Snoop"

#string STR_PCIE_NOSNOOP_HELP           #language en-US "Enables or Disables PCI Express Device No Snoop option."



#string STR_PCIE_MAXPAYLOAD_PROMPT      #language en-US "Maximum Payload"

#string STR_PCIE_MAXPAYLOAD_HELP        #language en-US "Set Maximum Payload of PCI Express Device or allow System BIOS to select the value."



#string STR_PCIE_MAXREADREQUEST_PROMPT  #language en-US "Maximum Read Request"

#string STR_PCIE_MAXREADREQUEST_HELP    #language en-US "Set Maximum Read Request Size of PCI Express Device or allow System BIOS to select the value."



#string STR_MP128                       #language en-US "128 Bytes"

#string STR_MP256                       #language en-US "256 Bytes"

#string STR_MP512                       #language en-US "512 Bytes"

#string STR_MP1024                      #language en-US "1024 Bytes"

#string STR_MP2048                      #language en-US "2048 Bytes"

#string STR_MP4096                      #language en-US "4096 Bytes"



#string STR_PCIE_ASPM_PROMPT            #language en-US "ASPM Support"

#string STR_PCIE_ASPM_HELP              #language en-US "Set the ASPM Level: Force L0 - Force all links to L0 State : AUTO - BIOS auto configure : DISABLE - Disables ASPM"



#string STR_PCIE_LINK_WARN1             #language en-US "Set the ASPM Level supported by the PCI-E Link,"

#string STR_PCIE_LINK_WARN2             #language en-US "         or allow BIOS to set value."

#string STR_PCIE_LINK_WARN3             #language en-US "WARNING: Enabling ASPM may cause some"

#string STR_PCIE_LINK_WARN4             #language en-US "         PCI-E devices to fail"



#string STR_FORCE_L0                    #language en-US "Force L0"

#string STR_L1                          #language en-US "L1" 



#string STR_PCIE_EXTD_SYNCH_PROMPT      #language en-US "Extended Synch"

#string STR_PCIE_EXTD_SYNCH_HELP        #language en-US "If ENABLED allows generation of Extended Synchronization patterns."



#string STR_PCIE_EXTTAGFLD_PROMPT       #language en-US "Extended Tag"

#string STR_PCIE_EXTTAGFLD_HELP         #language en-US "If ENABLED allows Device to use 8-bit Tag field as a requester."



#string STR_1M                          #language en-US "1 M" 

#string STR_2M                          #language en-US "2 M" 

#string STR_4M                          #language en-US "4 M" 

#string STR_8M                          #language en-US "8 M" 

#string STR_16M                         #language en-US "16 M" 

#string STR_32M                         #language en-US "32 M" 

#string STR_64M                         #language en-US "64 M" 

#string STR_128M                        #language en-US "128 M" 

#string STR_256M                        #language en-US "256 M" 

#string STR_512M                        #language en-US "512 M" 

#string STR_1G                          #language en-US "1 G" 



// 

//  strings for ACPI

// 

// strings for reset testing



#string STR_RESETTESTINGSV_FORM                 #language en-US "ResetTesting"

#string STR_RESETTESTINGSV_FORM_HELP            #language en-US "All SV reset testing options"



#string STR_VALIDATION_RESET_TYPE_PROMPT        #language en-US "Reset Type"

#string STR_VALIDATION_RESET_TYPE_HELP          #language en-US "Option for forcing reset testing based on reset type selected"

#string STR_COLD_RESET                          #language en-US "Cold"

#string STR_WARM_RESET                          #language en-US "Warm"

#string STR_POWER_CYCLE_RESET                   #language en-US "Power cycle reset"

#string STR_CPU_INIT_RESET                      #language en-US "CPU Init reset"

#string STR_RANDOM_RESET                        #language en-US "Random"



#string STR_VALIDATION_RESET_EVENT_PROMPT       #language en-US "Reset Event"

#string STR_VALIDATION_RESET_EVENT_HELP         #language en-US "Select the place when the reset event should happen."

#string STR_BEFORE_MRC                          #language en-US "Before MRC"

#string STR_AFTER_MRC                           #language en-US "After MRC"

#string STR_READY_TO_BOOT                       #language en-US "Ready To Boot"



#string STR_VALIDATION_RESET_COUNT_PROMPT       #language en-US "Reset Count"

#string STR_VALIDATION_RESET_COUNT_HELP         #language en-US "Enter number of Reset cycles."



#string STR_CHIPSET                     #language en-US "Chipset"

#string STR_CHIPSET_HELP                #language en-US "Chipset Settings"

// Denverton AptioV override end - EIP#278398
#string STR_EFI_NETWORK_GPE27         #language en-US "Force GPE27 on Sx path"
#string STR_EFI_NETWORK_GPE27_HELP    #language en-US "Sets the GPE27 (Bit 70 of GPE block) on the Sx path regardless the OS configuration"
